app/controllers/users_controller.rb

  def new
    @user = User.new()
    @courses = Course.all
---
SELECT "courses".* FROM "courses"